#Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. Пользователь в первой строке 
#вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X



import random
A = []
N = int(input("Введите длину массива: "))
X = int(input("C каким числом нужно сравнить?: "))

for i in range(N):
    A.append(random.randint(0, 101))
count = A[0]
for i in range(N):
    if abs(count - X) > abs(A[i] - X):
        count = A[i]
print(A)
print(count)
